Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG00/atdf/PIC32CK2051SG00100.atdf
        <register name="CHCTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="CHANNEL CONTROL REGISTER B">
          <bitfield name="WAS" caption="Channel Write Address Sequence." mask="0x7" values="CHCTRLB__WAS"/>
          <bitfield name="RAS" caption="Channel Read Address Sequence" mask="0x70" values="CHCTRLB__RAS"/>
          <bitfield name="PRI" caption="Channel Priority level." mask="0x300" values="CHCTRLB__PRI"/>
          <bitfield name="WBOEN" caption="Write Byte Order Enable" mask="0x2000"/>
          <bitfield name="BYTORD" caption="Byte Order" mask="0xC000" values="CHCTRLB__BYTORD"/>
          <bitfield name="TRIG" caption="Trigger that can Start a Channel Transfer" mask="0xFF0000"/>
          <bitfield name="PIGNEN" caption="Enable Pattern Ignore Byte" mask="0x1000000"/>
          <bitfield name="PATLEN" caption="Pattern Match Length" mask="0x2000000"/>
          <bitfield name="PATEN" caption="Channel Pattern Match Abort Enable." mask="0x4000000"/>
          <bitfield name="CASTEN" caption="Cell Auto Start Enable of Ensuing Transfers for this channel" mask="0x20000000"/>
          <bitfield name="CRCEN" caption="CRC Enable bit" mask="0x80000000"/>
        </register>
        <register name="CHEVCTRL" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="CHANNEL EVENT CONTROL REGISTER">
          <bitfield name="EVAUXACT" caption="Channel Auxiliary Event Input Action" mask="0x3" values="CHEVCTRL__EVAUXACT"/>
          <bitfield name="EVOMODE" caption="Channel Event Output Mode" mask="0xC" values="CHEVCTRL__EVOMODE"/>
          <bitfield name="EVAUXIE" caption="Channel Auxiliary Event Enable (0: disable; 1: enable)" mask="0x20"/>
          <bitfield name="EVSTRIE" caption="Channel Start Event Input Enable (0: disable; 1:enable)" mask="0x40"/>
          <bitfield name="EVOE" caption="Channel Event Output Enable (0: disable; 1: enable)" mask="0x80"/>
        </register>
        <register name="CHINTENCLR" offset="0xC" rw="RW" size="4" atomic-op="clear:CHINTENCLR" initval="0x00000000" caption="CHANNEL INTERRUPT ENABLE CLEAR REGISTER">
          <bitfield name="SD" caption="Channel Event Output Enable" mask="0x1"/>
          <bitfield name="TA" caption="Clear Transfer Abort Interrupt Enable" mask="0x2"/>
          <bitfield name="CC" caption="Clear Cell Transfer Complete Interrupt Enable" mask="0x4"/>
          <bitfield name="BC" caption="Clear Cell Transfer Complete Interrupt Enable" mask="0x8"/>
          <bitfield name="BH" caption="Clear Block Transfer Half Complete Interrupt Enable" mask="0x10"/>
          <bitfield name="LL" caption="Clear Linked List Done Interrupt Enable" mask="0x20"/>
        </register>
        <register name="CHINTENSET" offset="0x10" rw="RW" size="4" atomic-op="set:CHINTENSET" initval="0x00000000" caption="CHANNEL INTERRUPT ENABLE SET REGISTER">
          <bitfield name="SD" caption="Channel Event Output Enable" mask="0x1"/>
          <bitfield name="TA" caption="Set Transfer Abort Interrupt Enable" mask="0x2"/>
          <bitfield name="CC" caption="set Cell Transfer Complete Interrupt Enable" mask="0x4"/>
          <bitfield name="BC" caption="set Cell Transfer Complete Interrupt Enable" mask="0x8"/>
          <bitfield name="BH" caption="set Block Transfer Half Complete Interrupt Enable" mask="0x10"/>
          <bitfield name="LL" caption="set Linked List Done Interrupt Enable" mask="0x20"/>
        </register>
        <register name="CHINTF" offset="0x14" rw="RW" size="4" atomic-op="clear:CHINTF" initval="0x00000000" caption="CHANNEL INTERRUPT FLAG REGISTER">
          <bitfield name="SD" caption="Start Detected Interrupt Flag (0: none ; 1: Start Detected)" mask="0x1"/>
          <bitfield name="TA" caption="Transfer Abort Interrupt Flag (0: none; 1: Transfer Aborted)" mask="0x2"/>
          <bitfield name="CC" caption="Cell Transfer Complete Interrupt Flag (0: none ; 1: complete)" mask="0x4"/>
          <bitfield name="BC" caption="Block Transfer Complete Interrupt Flag (0: none; 1:complete;)" mask="0x8"/>
          <bitfield name="BH" caption="Block Transfer Half Complete Interrupt Flag (0: none; 1: half complete)" mask="0x10"/>
          <bitfield name="LL" caption="Linked List Done Interrupt Flag (0: none; 1: done)" mask="0x20"/>
          <bitfield name="WRE" caption="Write Error Flag (0: none; 1: Write Error)" mask="0x20000"/>
          <bitfield name="RDE" caption="Read Error Flag (0: none; 1: Read Error)" mask="0x40000"/>
        </register>
        <register name="CHSSA" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="CHANNEL SOURCE START ADDRESS">
          <bitfield name="SSA" caption="Channel Source Start Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="CHDSA" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="CHANNEL DESTINATION START ADDRESS">
          <bitfield name="DSA" caption="Channel Destination Start Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="CHSSTRD" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="CHANNEL SOURCE CELL STRIDE SIZE REGISTER">
          <bitfield name="SSTRD" caption="Source Cell Stride Size" mask="0xFFFF"/>
        </register>
        <register name="CHDSTRD" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="CHANNEL DESTINATION CELL STRIDE SIZE REGISTER">
          <bitfield name="DSTRD" caption="Destination Cell Stride Size" mask="0xFFFF"/>
        </register>
        <register name="CHXSIZ" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="CHANNEL TRANSFER SIZE REGISTER">
          <bitfield name="CSZ" caption="Cell transfer size in bytes." mask="0x3FF"/>
          <bitfield name="BLKSZ" caption="Block transfer size in bytes." mask="0xFFFF0000"/>
        </register>
        <register name="CHPDAT" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="CHANNEL PATTERN MATCH DATA">
          <bitfield name="PDAT" caption="Channel Pattern Match Data" mask="0xFFFF"/>
          <bitfield name="PIGN" caption="Channel Pattern Ignore Value" mask="0xFF000000"/>
        </register>
        <register name="CHCTRLCRC" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="CHANNEL CONTROL CRC">
          <bitfield name="CRCMD" caption="CRC/Checksum Mode" mask="0x7" values="CHCTRLCRC__CRCMD"/>
          <bitfield name="CRCAPP" caption="CRC Append Mode" mask="0x8"/>
          <bitfield name="CRCXOR" caption="CRC XOR Mode" mask="0x20"/>
          <bitfield name="CRCROUT" caption="CRC Reflected Output Mode" mask="0x40"/>
          <bitfield name="CRCRIN" caption="CRC Reflect Input Selection" mask="0x80"/>
        </register>
        <register name="CHCRCDAT" offset="0x34" rw="RW" size="4" initval="0x00000000" caption="CHANNEL CRC/CHECKSUM DATA REGISTER">
          <bitfield name="CRCDAT" caption="CRC Data" mask="0xFFFFFFFF"/>
        </register>
