Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG00/atdf/PIC32CK2051SG00100.atdf
        <register name="INTENCLR" offset="0x8" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear Register">
          <bitfield name="SERR" caption="Flash SEC Interrupt Clear Enable" mask="0x1"/>
          <bitfield name="DERR" caption="ECC Double Error Detected Clear Enable" mask="0x2"/>
          <bitfield name="CRCDONE" caption="CRC Calculation Done Clear Enable" mask="0x100"/>
          <bitfield name="CRCERR" caption="CRC Error Clear Enable" mask="0x200"/>
          <bitfield name="FLTCAP" caption="ECC Fault Capture Clear Enable" mask="0x10000"/>
        </register>
        <register name="INTENSET" offset="0xC" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable SET Register">
          <bitfield name="SERR" caption="Flash Single Error Corrected Set Enable" mask="0x1"/>
          <bitfield name="DERR" caption="ECC Double Error Detected Set Enable" mask="0x2"/>
          <bitfield name="CRCDONE" caption="CRC Calculation Done Set Enable" mask="0x100"/>
          <bitfield name="CRCERR" caption="CRC Error Interrupt Set Enable" mask="0x200"/>
          <bitfield name="FLTCAP" caption="ECC Fault Capture Interrupt Set Enable" mask="0x10000"/>
        </register>
        <register name="INTFLAG" offset="0x10" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Register">
          <bitfield name="SERR" caption="Flash Single Error Corrected Flag" mask="0x1"/>
          <bitfield name="DERR" caption="ECC Double Error Detected Flag" mask="0x2"/>
          <bitfield name="CRCDONE" caption="CRC Calculation Done Flag" mask="0x100"/>
          <bitfield name="CRCERR" caption="CRC Error Flag" mask="0x200"/>
          <bitfield name="FLTCAP" caption="ECC Fault Capture Flag" mask="0x10000"/>
        </register>
        <register name="STATUS" offset="0x14" rw="R" size="4" initval="0x00000000" caption="NVM Status Register">
          <bitfield name="PRM" caption="NVM Power Reduction Mode Status" mask="0x1"/>
          <bitfield name="TEMP" caption="NVM Operating Temperature Read Mode Status" mask="0x2"/>
        </register>
        <register name="DBGCTRL" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="Debug Control Register">
          <bitfield name="CRCRUN" caption="CRC Debug Run" mask="0x1"/>
          <bitfield name="DBGECC" caption="Debug ECC Mode" mask="0x6"/>
        </register>
        <register name="ECCCTRL" offset="0x1C" rw="RW" size="4" initval="0x00000040" caption="ECC Control Register">
          <bitfield name="ECCCTL" caption="NVM ECC Mode Control- restricts one or more NVMOPs" mask="0x30"/>
          <bitfield name="ECCUNLCK" caption="NVM ECC Mode Control Unlock" mask="0x40"/>
          <bitfield name="SECCNT" caption="Flash SEC Count" mask="0xFF00"/>
        </register>
        <register name="CRCCTRL" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="CRC Control Register">
          <bitfield name="CRCRST" caption="CRC Reset" mask="0x1"/>
          <bitfield name="CRCEN" caption="Start CRC Calculation" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="CRC Run in Standby" mask="0x20"/>
          <bitfield name="PLEN32" caption="Polynomial Length Select" mask="0x1000"/>
          <bitfield name="AUTOR" caption="CRC Auto Repeat" mask="0x2000"/>
          <bitfield name="ROUT" caption="CRC Reflected Output" mask="0x4000"/>
          <bitfield name="RIN" caption="CRC Reflected Input" mask="0x8000"/>
          <bitfield name="PERIOD" caption="Read Period in GCLK counts" mask="0xFFFF0000"/>
        </register>
        <register name="CRCPAUSE" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="CRC PAUSE Register">
          <bitfield name="PAUSE" caption="CRC Pause" mask="0x1"/>
        </register>
        <register name="CRCMADR" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="CRC Message Address Register">
          <bitfield name="CRCMADR" caption="Message Start Address in Flash" mask="0xFFFFFFF"/>
        </register>
        <register name="CRCMLEN" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="CRC Message Length Register">
          <bitfield name="CRCMLEN" caption="Message Length in Bytes" mask="0xFFFFFF"/>
        </register>
        <register name="CRCIV" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="CRC Initial Value Register">
          <bitfield name="CRCIV" caption="CRC Initial Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="CRCACC" offset="0x34" rw="R" size="4" initval="0x00000000" caption="CRC Accumulator Register">
          <bitfield name="CRCACC" caption="CRC Accumulator Result" mask="0xFFFFFFFF"/>
        </register>
        <register name="CRCPOLY" offset="0x38" rw="RW" size="4" initval="0x00000001" caption="CRC Polynomial Register">
          <bitfield name="CRCPOLY" caption="CRC Polynomial Coefficients for LFSR" mask="0xFFFFFFFF"/>
        </register>
        <register name="CRCFXOR" offset="0x3C" rw="RW" size="4" initval="0x00000000" caption="CRC Final XOR Register">
          <bitfield name="CRCFXOR" caption="CRC Final XOR" mask="0xFFFFFFFF"/>
        </register>
        <register name="CRCSUM" offset="0x40" rw="RW" size="4" initval="0x00000000" caption="CRC Checksum Register">
          <bitfield name="CRCSUM" caption="CRC Checksum" mask="0xFFFFFFFF"/>
        </register>
        <register name="FFLTCTRL" offset="0x44" rw="RW" size="4" initval="0x00000000" caption="Flash ECC Fault Control Register">
          <bitfield name="FLTRST" caption="Fault Reset" mask="0x1"/>
          <bitfield name="FLTEN" caption="ECC Fault Enable bit" mask="0x2"/>
          <bitfield name="CTLFLT" caption="ECC/Parity Control Fault bits" mask="0x700"/>
          <bitfield name="FLTMD" caption="Fault Mode Control" mask="0x7000"/>
        </register>
        <register name="FFLTPTR" offset="0x48" rw="RW" size="4" initval="0x00000000" caption="Flash ECC Fault Pointer Register">
          <bitfield name="FLT1PTR" caption="Fault 1 Injection Pointer" mask="0x1FF"/>
          <bitfield name="FLT2PTR" caption="Fault 2 Injection Pointer" mask="0x1FF0000"/>
        </register>
        <register name="FFLTADR" offset="0x4C" rw="RW" size="4" initval="0x00000000" caption="Flash Fault Address Register">
          <bitfield name="FLTADR" caption="Fault Inject Mode - Physical Address" mask="0xFFFFFFF"/>
        </register>
        <register name="FFLTCAP" offset="0x50" rw="R" size="4" initval="0x00000000" caption="Flash Fault Capture Address Register">
          <bitfield name="FLTADR" caption="Fault capture Mode - Physical Address" mask="0xFFFFFFF"/>
        </register>
        <register name="FFLTPAR" offset="0x54" rw="R" size="4" initval="0x00000000" caption="Flash ECC Fault Parity Register">
          <bitfield name="SECIN" caption="The Single Error Parity bits from Flash" mask="0x1FF"/>
          <bitfield name="DEDIN" caption="The Overall Parity from Flash" mask="0x8000"/>
          <bitfield name="SECOUT" caption="The Calculated Single Error Parity bits" mask="0x1FF0000"/>
          <bitfield name="DEDOUT" caption="The Calculated Overall Parity used in Double Error Detection" mask="0x80000000"/>
        </register>
