Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG00/atdf/PIC32CK2051SG00100.atdf
        <register name="INTENSET" offset="0xC" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="INTERRUPT ENABLE SET">
          <bitfield name="ERROR" caption="Error Interrupt Enable" mask="0x1"/>
          <bitfield name="TAMPER" caption="Tamper Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTFLAG" offset="0x10" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="INTERRUPT FLAG">
          <bitfield name="ERROR" caption="Error Interrupt Flag" mask="0x1"/>
          <bitfield name="TAMPER" caption="Tamper Interrupt Flag" mask="0x2"/>
        </register>
        <register name="STATUS" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="STATUS">
          <bitfield name="BUSY" caption="HSM CPU BUSY" mask="0x1"/>
          <bitfield name="LKUP" caption="HSM CPU LOCKUP" mask="0x2"/>
          <bitfield name="PS" caption="PROCESSING STATE" mask="0x70"/>
          <bitfield name="LCS" caption="LIFECYCLE STATE" mask="0x700"/>
          <bitfield name="SBS" caption="SECURE BOOT STATE" mask="0x7000"/>
          <bitfield name="ECODE" caption="ERROR CODE" mask="0xF0000"/>
        </register>
        <register name="MBFIFO" offset="0x100" rw="RW" ocd-rw="" size="4" count="16" initval="0x00000000" caption="MAILBOX FIFO">
          <bitfield name="MBFIFO" caption="MAILBOX FIFO" mask="0xFFFFFFFF"/>
        </register>
        <register name="MBTXSTATUS" offset="0x140" rw="RW" size="4" initval="0x00100000" caption="MAILBOX TRANSMIT STATUS">
          <bitfield name="TXREMAINING" caption="TRANSMIT BYTES REMAINING" mask="0xFFFF"/>
          <bitfield name="TXTYPE" caption="TRANSMIT MESSAGE HEADER TYPE" mask="0xF0000"/>
          <bitfield name="TXINT" caption="TRANSMIT FIFO INTERRUPT FLAG" mask="0x100000"/>
          <bitfield name="TXFULL" caption="TRANSMIT FIFO FULL" mask="0x200000"/>
          <bitfield name="TXERR" caption="TRANSMIT ERROR" mask="0x800000"/>
        </register>
        <register name="MBRXSTATUS" offset="0x144" rw="RW" size="4" initval="0x00200000" caption="MAILBOX RECEIVE STATUS">
          <bitfield name="RXREMAINING" caption="RECEIVE BYTES REMAINING" mask="0xFFFF"/>
          <bitfield name="RXTYPE" caption="RECEIVE MESSAGE HEADER TYPE" mask="0xF0000"/>
          <bitfield name="RXINT" caption="RECEIVE FIFO INTERRUPT FLAG" mask="0x100000"/>
          <bitfield name="RXEMPTY" caption="RECEIVE FIFO FULL" mask="0x200000"/>
          <bitfield name="RXHEAD" caption="Receive Header Next Word bit" mask="0x400000"/>
          <bitfield name="RXERR" caption="RECEIVE ERROR" mask="0x800000"/>
        </register>
        <register name="MBTXPROT" offset="0x148" rw="RW" size="4" initval="0x00000000" caption="MAILBOX TX PROTECTION">
          <bitfield name="UNPROT" caption="MAILBOX UNPROTECTED" mask="0x200000"/>
          <bitfield name="PRIV" caption="MAILBOX MESSAGE PRIVILEDGED ACCESS" mask="0x400000"/>
          <bitfield name="NSEC" caption="MAILBOX MESSAGE NON-SECURE ACCESS" mask="0x800000"/>
          <bitfield name="USER" caption="USER SIDEBAND" mask="0xFF000000"/>
        </register>
        <register name="MBRXPROT" offset="0x14C" rw="RW" size="4" initval="0x00000000" caption="MAILBOX RX PROTECTION">
          <bitfield name="UNPROT" caption="MAILBOX UNPROTECTED" mask="0x200000"/>
          <bitfield name="PRIV" caption="MAILBOX MESSAGE PRIVILEDGED ACCESS" mask="0x400000"/>
          <bitfield name="NSEC" caption="MAILBOX MESSAGE NON-SECURE ACCESS" mask="0x800000"/>
          <bitfield name="USER" caption="USER SIDEBAND" mask="0xFF000000"/>
        </register>
        <register name="MBTXHEAD" offset="0x150" rw="RW" ocd-rw="" size="4" initval="0x00000000" caption="MAILBOX TRANSMIT HEADER">
          <bitfield name="TXHEAD" caption="MAILBOX TRANSMIT HEADER REGISTER" mask="0xFFFFFFFF"/>
        </register>
        <register name="MBRXHEAD" offset="0x154" rw="RW" ocd-rw="" size="4" initval="0x00000000" caption="MAILBOX RECEIVE HEADER">
          <bitfield name="RXHEAD" caption="MAILBOX RECEIVE HEADER REGISTER" mask="0xFFFFFFFF"/>
        </register>
        <register name="MBCONFIG" offset="0x158" rw="RW" size="4" initval="0x00000000" caption="MAILBOX CONFIGURATION">
          <bitfield name="TXINT" caption="MAILBOX TRANSMIT INTERRUPT ENABLE" mask="0x1"/>
          <bitfield name="RXINT" caption="MAILBOX RECEIVE INTERRUPT ENABLE" mask="0x2"/>
        </register>
      </register-group>
    </module>
    <module name="ICB" id="SYSTEM_IP" version="1.0.0" caption="Implementation Control Block">
      <register-group name="ICB" caption="Implementation Control Block">
        <register name="ICTR" offset="0x4" rw="R" size="4" access-size="4" caption="Interrupt Controller Type Register">
          <bitfield name="INTLINESNUM" caption="Interrupt line set number" mask="0xF"/>
        </register>
        <register name="ACTLR" offset="0x8" rw="RW" size="4" access-size="4" caption="Auxiliary Control Register">
        </register>
        <register name="CPPWR" offset="0xC" rw="RW" size="4" access-size="4" caption="Coprocessor Power Control Register">
          <bitfield name="SU0" caption="State UNKNOWN 0" mask="0x1"/>
          <bitfield name="SUS0" caption="State UNKNOWN Secure only 0" mask="0x2"/>
          <bitfield name="SU1" caption="State UNKNOWN 1" mask="0x4"/>
          <bitfield name="SUS1" caption="State UNKNOWN Secure only 1" mask="0x8"/>
          <bitfield name="SU2" caption="State UNKNOWN 2" mask="0x10"/>
          <bitfield name="SUS2" caption="State UNKNOWN Secure only 2" mask="0x20"/>
          <bitfield name="SU3" caption="State UNKNOWN 3" mask="0x40"/>
          <bitfield name="SUS3" caption="State UNKNOWN Secure only 3" mask="0x80"/>
          <bitfield name="SU4" caption="State UNKNOWN 4" mask="0x100"/>
          <bitfield name="SUS4" caption="State UNKNOWN Secure only 4" mask="0x200"/>
          <bitfield name="SU5" caption="State UNKNOWN 5" mask="0x400"/>
          <bitfield name="SUS5" caption="State UNKNOWN Secure only 5" mask="0x800"/>
          <bitfield name="SU6" caption="State UNKNOWN 6" mask="0x1000"/>
          <bitfield name="SUS6" caption="State UNKNOWN Secure only 6" mask="0x2000"/>
          <bitfield name="SU7" caption="State UNKNOWN 7" mask="0x4000"/>
          <bitfield name="SUS7" caption="State UNKNOWN Secure only 7" mask="0x8000"/>
          <bitfield name="SU10" caption="State UNKNOWN 10" mask="0x100000"/>
          <bitfield name="SUS10" caption="State UNKNOWN Secure only 10" mask="0x200000"/>
          <bitfield name="SU11" caption="State UNKNOWN 11" mask="0x400000"/>
          <bitfield name="SUS11" caption="State UNKNOWN Secure only 11" mask="0x800000"/>
        </register>
      </register-group>
    </module>
    <module name="IDAU" id="04250" name2="sec_idau_v3" version="3a0" caption="Implementation Defined Attribution Unit">
      <register-group name="REGIONS" size="0x10">
        <register name="RCTRL" offset="0x0" rw="W" size="4" initval="0x00000000" caption="Region Control">
          <mode name="BLOCK" caption="Block Based Region"/>
          <mode name="WATERMARK" caption="Watermark Based Region"/>
          <bitfield modes="BLOCK" name="ARG" caption="Command Argument (Block ID)" mask="0x1F"/>
          <bitfield modes="WATERMARK" name="ARG" caption="Command Argument (Watermark)" mask="0xFFFFFF"/>
          <bitfield modes="BLOCK" name="CMD" caption="Command" mask="0xFF000000" values="RCTRL_BLOCK__CMD"/>
          <bitfield modes="WATERMARK" name="CMD" caption="Command" mask="0xFF000000" values="RCTRL_WATERMARK__CMD"/>
        </register>
        <register name="RSTATUSA" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Region Status A">
          <bitfield name="TYPE" caption="IDAU Region Type" mask="0xF" values="RSTATUSA__TYPE"/>
          <bitfield name="GRAN" caption="Region Granularity" mask="0x3F00" values="RSTATUSA__GRAN"/>
          <bitfield name="MAXSZ" caption="Command Argument Maximum Size" mask="0x3F0000"/>
        </register>
        <register name="RSTATUSB" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Region Status B">
          <mode name="BLOCK" caption="Block Based Region"/>
          <mode name="WATERMARK" caption="Watermark Based Region"/>
          <bitfield modes="BLOCK" name="NONSEC" caption="Block Based Region Non-Secure State" mask="0xFFFFFFFF"/>
          <bitfield modes="WATERMARK" name="SIZE" caption="Watermark Based Region Size in Bytes" mask="0xFFFFFFFF"/>
        </register>
        <register name="RSTATUSC" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Region Status C">
          <mode name="BLOCK"/>
          <mode name="LINK"/>
          <bitfield modes="LINK" name="RGN" caption="Linked IDAU Region ID" mask="0xFF"/>
          <bitfield modes="LINK" name="BLK" caption="Linked IDAU Region Block ID" mask="0x1F00"/>
          <bitfield modes="BLOCK" name="CST" caption="Constant Block Configuration" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <register-group name="IDAU" caption="Implementation Defined Attribution Unit">
        <register name="CTRL" offset="0x0" rw="W" size="4" initval="0x00000000" caption="Control">
          <bitfield name="CMD" caption="Command Register" mask="0xFFFF0000" values="CTRL__CMD"/>
        </register>
        <register name="STATUSA" offset="0x4" rw="R" size="4" caption="Status A">
          <bitfield name="ENABLE" caption="Enable" mask="0x1"/>
          <bitfield name="WLCK" caption="Write Lock" mask="0x2"/>
          <bitfield name="NBRG" caption="Number Of IDAU Regions" mask="0x1FF00"/>
        </register>
        <register name="STATUSB" offset="0x8" rw="RW" size="4" atomic-op="clear:STATUSB" initval="0x00000000" caption="Status B">
          <bitfield name="CFGERR" caption="Configuration Error" mask="0x1"/>
        </register>
        <register-group name="REGIONS" name-in-module="REGIONS" offset="0x1000" size="0x10" count="24"/>
      </register-group>
      <value-group name="RCTRL_BLOCK__CMD">
        <value name="CLRNONSEC" caption="Clear IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=0)" value="0x5A"/>
        <value name="SETNONSEC" caption="Set IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=1)" value="0x5B"/>
      </value-group>
      <value-group name="RCTRL_WATERMARK__CMD">
        <value name="WRSZ" caption="Write IDAU region x Size (RSTATUSB[x].SIZE=ARG)" value="0x5C"/>
      </value-group>
