Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG00/atdf/PIC32CK2051SG00100.atdf
        <register name="STAT1" offset="0x12C" rw="R" size="4" atomic-op="clear:STAT1" initval="0x01000000" caption="SPI Status1 Register">
          <bitfield name="RXBUFCNT" caption="Number of Words of Read Data in the FIFO." mask="0xFFFF"/>
          <bitfield name="TXBUFFREE" caption="Number of Words of Space available in the TX FIFO. Max value equals value of MEM_SIZE_BYTES parameter. Default value is Max" mask="0xFFFF0000"/>
        </register>
        <register name="STAT2" offset="0x130" rw="R" size="4" atomic-op="clear:STAT2" initval="0x00000000" caption="SPI status 2 register">
          <bitfield name="TXOV" caption="This bit would get set when TX FIFO OVERFLOW happens. S/W needs to monitor TX_FIFO_FREE when filling TX_FIFO to make sure TX FIFO doesn?t over flow or in case OVERFLOW bit gets set, then TX_FIFO_RST (bit 17 of SPI Configuration register) should be set which would then clear TX FIFO pointers and hence this bit would get cleared. Generally software should avoid getting into this condition." mask="0x1"/>
          <bitfield name="RXUN" caption="This bit would get set when RX FIFO UNDERFLOW happens.  S/W needs to monitor RX_FIFO_CNT when emptying RX_FIFO to make sure RX FIFO doesn?t under flow or in case UNDERFLOW bit gets set, then RX_FIFO_RST (bit 18 of SPI Configuration register) must be set which would then clear RX FIFO pointers and hence this bit would get cleared. Generally software should avoid getting into this condition." mask="0x2"/>
          <bitfield name="SQID0" caption="SPI Data bus:  This status is used to check the SPI DATA line level for Debugging. Bit3 - SPI_IO0 ,Bit4 - SPI_IO1 ,Bit5 - SPI_IO2 ,Bit6 - SPI_IO3" mask="0x8"/>
          <bitfield name="SQID1" caption="SPI Data bus:  This status is used to check the SPI DATA line level for Debugging. Bit3 - SPI_IO0 ,Bit4 - SPI_IO1 ,Bit5 - SPI_IO2 ,Bit6 - SPI_IO3" mask="0x10"/>
          <bitfield name="SQID2" caption="SPI Data bus:  This status is used to check the SPI DATA line level for Debugging. Bit3 - SPI_IO0 ,Bit4 - SPI_IO1 ,Bit5 - SPI_IO2 ,Bit6 - SPI_IO3" mask="0x20"/>
          <bitfield name="SQID3" caption="SPI Data bus:  This status is used to check the SPI DATA line level for Debugging. Bit3 - SPI_IO0 ,Bit4 - SPI_IO1 ,Bit5 - SPI_IO2 ,Bit6 - SPI_IO3" mask="0x40"/>
          <bitfield name="CONAVAIL" caption="Indicates the number of entries in Control Buffer remaining. NOTE: This field not present in Michigan Ax versions. Treat as Reserved." mask="0x380"/>
          <bitfield name="CMDSTAT" caption="Reflect the (internal state machine) CMD_INIT value. Indicates whether the controller is in Transmit/Receive/IDLE state. 2?b00 - IDLE ,2?b01 - Transmit ,2?b10 - Receive ,2?b11 - Reserved" mask="0x30000"/>
        </register>
        <register name="BDCON" offset="0x134" rw="RW" size="4" initval="0x00000000" caption="BD_CTRL Register">
          <bitfield name="DMAEN" caption="DMA Enable Bit 1 - Enabled, 0 - Disabled" mask="0x1"/>
          <bitfield name="POLLEN" caption="Setting this bit would cause Buffer Descriptor processor (BDP) to poll for descriptor valid till descriptor valid bit is set or till poll counter expires based on value programmed in BD_POLL_CTRL register." mask="0x2"/>
          <bitfield name="START" caption="Setting this bit to '1' would start BDP (Buffer Descriptor Processor) to fetch a  descriptor and hence this bit should be enabled only after all the DMA descriptor programming is done. Hardware clears this bit automatically after one clock cycle." mask="0x4"/>
        </register>
        <register name="BDCURADD" offset="0x138" rw="R" size="4" initval="0x00000000" caption="BD_CURR_ADDR Register">
          <bitfield name="BDCURRADDR" caption="This register field contains the current descriptor address being processed by Buffer Descriptor Processor (BDP)" mask="0xFFFFFFFF"/>
        </register>
        <register name="BDBASEADD" offset="0x140" rw="RW" size="4" initval="0x00000000" caption="BD_BASE_ADDR register">
          <bitfield name="BDADDR" caption="This register field contains the base address of the DMA. This register must be updated only when the DMA is IDLE." mask="0xFFFFFFFF"/>
        </register>
        <register name="BDSTAT" offset="0x144" rw="R" size="4" caption="BD_STATUS Register">
          <bitfield name="BDCON" caption="This register field contains the current Descriptor control information. Bits [31:16] of BD_CTRL field of current descriptor are indicated in this register field." mask="0xFFFF"/>
          <bitfield name="DMAACTV" caption="A value of '1' would indicate that Buffer Descriptor Processor (BDP) is not Idle. Value of '0' would indicate that BDP is in IDLE state" mask="0x10000"/>
          <bitfield name="DMASTART" caption="This register field would indicate whether DMA has started or not, if bit it set '1', then it indicates DMA start has happened. Value of '0' would indicate that DMA hasn't started." mask="0x20000"/>
          <bitfield name="BDSTATE" caption="This register field contains current BDP state :  0  IDLE, 1  Descriptor fetch Request Pending, 2  BD loading, 3  Data phase , 4  Descriptor Done, 5  Fetched BD is disabled, 6  Wait for Control Buffer Available, 7  Wait for AHB Error Acknowledgement" mask="0x3C0000"/>
        </register>
        <register name="BDPOLLCON" offset="0x148" rw="RW" size="4" caption="BD_POLL_CTRL Register">
          <bitfield name="POLLCON" caption="Number of cycles that BDP block would wait before re-fetching the Descriptor control word if the previous descriptor fetched was disabled" mask="0xFFFF"/>
        </register>
        <register name="BDTXDSTAT" offset="0x14C" rw="RW" size="4" caption="BD_TX_DMA_STATUS Register">
          <bitfield name="TXCURBUFLEN" caption="This register field gives the length of the current buffer transmit length" mask="0xFFFF"/>
          <bitfield name="TXBUFCNT" caption="This register field gives the information about the internal transmit FIFO space." mask="0xFF0000"/>
        </register>
