Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG00/atdf/PIC32CK2051SG00100.atdf
        <register name="PIDR3" offset="0xFEC" rw="R" size="4" access-size="4" caption="TPIU Peripheral Identification Register 3">
          <bitfield name="CMOD" caption="Customer Modified" mask="0xF"/>
          <bitfield name="REVAND" caption="RevAnd" mask="0xF0"/>
        </register>
        <register name="CIDR0" offset="0xFF0" rw="R" size="4" access-size="4" initval="0x0000000D" caption="TPIU Component Identification Register 0">
          <bitfield name="PRMBL_0" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
        <register name="CIDR1" offset="0xFF4" rw="R" size="4" access-size="4" initval="0x00000090" caption="TPIU Component Identification Register 1">
          <bitfield name="PRMBL_1" caption="CoreSight component identification preamble" mask="0xF"/>
          <bitfield name="CLASS" caption="CoreSight component class" mask="0xF0"/>
        </register>
        <register name="CIDR2" offset="0xFF8" rw="R" size="4" access-size="4" initval="0x00000005" caption="TPIU Component Identification Register 2">
          <bitfield name="PRMBL_2" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
        <register name="CIDR3" offset="0xFFC" rw="R" size="4" access-size="4" initval="0x000000B1" caption="TPIU Component Identification Register 3">
          <bitfield name="PRMBL_3" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="SPPR__TXMODE">
        <value name="PARALLEL" caption="Parallel trace port mode" value="0"/>
        <value name="MAN" caption="Asynchronous SWO, using Manchester encoding" value="1"/>
        <value name="NRZ" caption="Asynchronous SWO, using NRZ encoding" value="2"/>
      </value-group>
      <value-group name="FFCR__EnFmt">
        <value name="BYPASS" caption="Disable formatting" value="0"/>
        <value name="CONT" caption="Continuous formatting and embed triggers and null cycles" value="2"/>
      </value-group>
      <value-group name="LAR__KEY">
        <value name="UNLOCK" caption="Unlock key value" value="0xC5ACCE55"/>
      </value-group>
    </module>
    <module name="TRAM" id="03938" name2="drm_tram_u2801_v2" version="2a0" caption="TrustRAM">
      <register-group name="TRAM" caption="TrustRAM">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="TAMPERS" caption="Tamper Erase" mask="0x10"/>
          <bitfield name="DRP" caption="Data Remanence Prevention" mask="0x40"/>
          <bitfield name="SILACC" caption="Silent Access" mask="0x80"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="ERR" caption="TrustRAM Readout Error Interrupt Enable" mask="0x1"/>
          <bitfield name="DRP" caption="Data Remanence Prevention Ended Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTENSET" offset="0x8" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="ERR" caption="TrustRAM Readout Error Interrupt Enable" mask="0x1"/>
          <bitfield name="DRP" caption="Data Remanence Prevention Ended Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTFLAG" offset="0xC" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="ERR" caption="TrustRAM Readout Error" mask="0x1"/>
          <bitfield name="DRP" caption="Data Remanence Prevention Ended" mask="0x2"/>
        </register>
        <register name="STATUS" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Status">
          <bitfield name="RAMINV" caption="RAM Inversion Bit" mask="0x1"/>
          <bitfield name="DRP" caption="Data Remanence Prevention Ongoing" mask="0x2"/>
        </register>
        <register name="SYNCBUSY" offset="0x14" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy Status">
          <bitfield name="SWRST" caption="Software Reset Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Busy" mask="0x2"/>
        </register>
        <register name="DSCC" offset="0x18" rw="W" size="4" initval="0x00000000" caption="Data Scramble Control">
          <bitfield name="DSCKEY" caption="Data Scramble Key" mask="0x3FFFFFFF"/>
          <bitfield name="DSCEN" caption="Data Scramble Enable" mask="0x80000000"/>
        </register>
        <register name="PERMW" offset="0x1C" rw="W" size="4" initval="0x00000000" caption="Permutation Write">
          <bitfield name="DATA" caption="Permutation Scrambler Data Input" mask="0x7"/>
        </register>
        <register name="PERMR" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Permutation Read">
          <bitfield name="DATA" caption="Permutation Scrambler Data Output" mask="0x7"/>
        </register>
        <register name="RAM" offset="0x1000" rw="RW" size="4" count="2048" initval="0x00000000" caption="TrustRAM">
          <bitfield name="DATA" caption="Trust RAM Data" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
    </module>
    <module name="TRNG" id="03597" name2="math_trng_u2242_v1" version="1d0" caption="True Random Generator">
      <register-group name="TRNG" caption="True Random Generator">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
        </register>
        <register name="EVCTRL" offset="0x4" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="DATARDYEO" caption="Data Ready Event Output" mask="0x1"/>
        </register>
